{"_id":{"$oid":"63351f1113c06c710ee568c9"},"Title":"Spider-Man: No Way Home","Description":"With Spider-Mans identity now revealed, our friendly neighborhood web-slinger is unmasked and no longer able to separate his normal life as Peter Parker from the high stakes of being a superhero. When Peter asks for help from Doctor Strange, the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Jon Watts","Bio":"Jonathan Watts is an American filmmaker. His credits include directing the Marvel Cinematic Universe superhero films Spider-Man: Homecoming, Spider-Man: Far From Home, and Spider-Man: No Way Home.","Birth":"28-JUN-1981"}}
{"_id":{"$oid":"63351fa513c06c710ee568ca"},"Title":"Spider-Man: No Way Home","Description":"Peter Parker relaxing European vacation takes an unexpected turn when Nick Fury shows up in his hotel room to recruit him for a mission. The world is in danger as four massive elemental creatures -- each representing Earth, air, water and fire -- emerge from a hole torn in the universe. Parker soon finds himself donning the Spider-Man suit to help Fury and fellow superhero Mysterio stop the evil entities from wreaking havoc across the continent.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Jon Watts","Bio":"Jonathan Watts is an American filmmaker. His credits include directing the Marvel Cinematic Universe superhero films Spider-Man: Homecoming, Spider-Man: Far From Home, and Spider-Man: No Way Home.","Birth":"28-JUN-1981"}}
{"_id":{"$oid":"6335221213c06c710ee568cb"},"Title":"Harry Potter and the Socerers Stone","Description":"Adaptation of the first of J.K. Rowling popular children novels about Harry Potter, a boy who learns on his eleventh birthday that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own. He is summoned from his life as an unwanted child to become a student at Hogwarts, an English boarding school for wizards. There, he meets several friends who become his closest allies and help him discover the truth about his parents mysterious death.","Genre":{"Name":"Fiction","Description":"Fiction is any creative work, chiefly any narrative work, portraying individuals, events, or places in ways that are imaginary or inconsistent with history, fact, or plausibility"},"Director":{"Name":"Chris Columbus","Bio":"Chris Joseph Columbus is an American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"10-SEP-1958"}}
{"_id":{"$oid":"6335380113c06c710ee568cc"},"Title":"Harry Potter and the Chamber of Secrets","Description":"The second installment of boy wizard Harry Potter adventures at Hogwarts School of Witchcraft and Wizardry, based on the novel by JK Rowling. A mysterious elf tells Harry to expect trouble during his second year at Hogwarts, but nothing can prepare him for trees that fight back, flying cars, spiders that talk and deadly warnings written in blood on the walls of the school.","Genre":{"Name":"Fiction","Description":"Fiction is any creative work, chiefly any narrative work, portraying individuals, events, or places in ways that are imaginary or inconsistent with history, fact, or plausibility."},"Director":{"Name":"Chris Columbus","Bio":"Chris Joseph Columbus is an American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"10-SEP-1958"}}
{"_id":{"$oid":"63353a0c13c06c710ee568cd"},"Title":"Harry Potter and the Prisoner of Azkaban","Description":"Harry Potter (Daniel Radcliffe) third year at Hogwarts starts off badly when he learns deranged killer Sirius Black (Gary Oldman) has escaped from Azkaban prison and is bent on murdering the teenage wizard. While Hermione (Emma Watson) cat torments Ron (Rupert Grint) sickly rat, causing a rift among the trio, a swarm of nasty Dementors is sent to protect the school from Black. A mysterious new teacher helps Harry learn to defend himself, but what is his secret tie to Sirius Black?","Genre":{"Name":"Fiction","Description":"Fiction is any creative work, chiefly any narrative work, portraying individuals, events, or places in ways that are imaginary or inconsistent with history, fact, or plausibility."},"Director":{"Name":"Chris Columbus","Bio":"Chris Joseph Columbus is an American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"10-SEP-1958"}}
{"_id":{"$oid":"63353b5413c06c710ee568ce"},"Title":"Harry Potter and the Goblet of Fire","Description":"The fourth movie in the Harry Potter franchise sees Harry (Daniel Radcliffe) returning for his fourth year at Hogwarts School of Witchcraft and Wizardry, along with his friends, Ron (Rupert Grint) and Hermione (Emma Watson). There is an upcoming tournament between the three major schools of magic, with one participant selected from each school by the Goblet of Fire. When Harry”s name is drawn, even though he is not eligible and is a fourth player, he must compete in the dangerous contest.","Genre":{"Name":"Fiction","Description":"Fiction is any creative work, chiefly any narrative work, portraying individuals, events, or places in ways that are imaginary or inconsistent with history, fact, or plausibility."},"Director":{"Name":"Chris Columbus","Bio":"Chris Columbus worked on Harry Potter films","Birth":"10-SEP-1958"}}
{"_id":{"$oid":"63353c5313c06c710ee568cf"},"Title":"Harry Potter and the Order of the Phoenix","Description":"Now in his fifth year at Hogwarts, Harry (Daniel Radcliffe) learns that many in the wizarding community do not know the truth of his encounter with Lord Voldemort. Cornelius Fudge, minister of Magic, appoints his toady, Dolores Umbridge, as Defense Against the Dark Arts teacher, for he fears that professor Dumbledore will take his job. But her teaching is deficient and her methods, cruel, so Harry prepares a group of students to defend the school against a rising tide of evil.","Genre":{"Name":"Fiction/Family","Description":"Fiction is any creative work, chiefly any narrative work, portraying individuals, events, or places in ways that are imaginary or inconsistent with history, fact, or plausibility."},"Director":{"Name":"Chris Columbus","Bio":"Chris Joseph Columbus is an American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"10-SEP-1958"}}
{"_id":{"$oid":"63362b279d53846fefc820a1"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"63362be99d53846fefc820a2"},"Title":"Raya and the Last Dragon","Description":"Once upon a time, dragons and humans lived together in peace.","Genre":{"Name":"Family","Description":"A family film is a film that the whole family can enjoy"},"Director":{"Name":"Don Hall","Bio":"Donald Lee Hall is an American film director, voice actor and writer at Walt Disney Animation Studios.","Birth":"1969"}}
